#+PROPERTY: header-args:python :session s :results output
#+PROPERTY: header-args:bash :results output

#+begin_src bash
  sh crosses.sh
#+end_src

#+RESULTS:

#+begin_src bash :results table
echo "method,max,bench,states,distinct,roots,time,sol,gold,args,in_deg,mergeable"
  cat crosses.csv
#+end_src

#+RESULTS:
| method       | max | bench                    | states | distinct | roots |        time | sol | gold |  args | in_deg | mergeable |
| cad_abs      |   9 | ../bench/cad2/crosses_5  |     89 |       85 |     1 |   26.814222 |   7 |    7 |   244 |    244 |       144 |
| cad_abs      |   9 | ../bench/cad2/crosses_10 |     92 |       92 |     1 |   74.909687 |   7 |    7 |   281 |    281 |       168 |
| cad_abs      |   9 | ../bench/cad2/crosses_20 |    115 |      115 |     1 |  206.509352 |   7 |    7 |   297 |    297 |       186 |
| cad_concrete |   9 | ../bench/cad2/crosses_5  |    388 |      188 |   188 |  111.266851 |   7 |    7 |  6935 |   6935 |      3505 |
| cad_concrete |   9 | ../bench/cad2/crosses_10 |   5048 |     3677 |  3677 | 6361.628771 |   7 |    7 | 98560 |  98560 |     49405 |
